app/views/users/view.html.haml

    // Get all dates from workouts and count unique dates
    - @sets = Workout.where(user_id: @user.id)
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 1]]