app/views/users/view.html.haml

SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 1]]
---
        // Get all dates from workouts and count unique dates
        - @sets = Workout.where(user_id: @user.id)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 7]]
---
        // Display this month as a calendar
        - @sets = Workout.where(user_id: @user.id)

SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = ?  [["user_id", 1]]
---
                        %br
                        - @exercise = Exercise.find(set.exercise_id)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ? AND "workouts"."exercise_id" = ? ORDER BY "workouts"."exercise_id" DESC  [["user_id", 1], ["exercise_id", 11]]
---
                    - @exercises.each do |exercise|
                        - @sets = Workout.where(user_id: @user.id, exercise_id: exercise.id)