app/views/workout/view.html.haml

SELECT "workouts".* FROM "workouts" WHERE (exercise_id =)
---
- @workout = Workout.unscoped.find(params[:id])