app/controllers/exercise_controller.rb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "exercises" ("user_id", "name", "unit", "group", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", nil], ["name", nil], ["unit", nil], ["group", nil], ["created_at", "2023-05-15 11:50:36.016242"], ["updated_at", "2023-05-15 11:50:36.016242"]]
---
  def view
    @exercise = Exercise.find(params[:id])
    if @exercise.user_id == current_user.id
      if @exercise.sets.count > 0
        if params[:from] == nil
          params[:from] = @exercise.sets.order(:created_at).first.created_at.strftime("%d/%m/%Y")

INSERT INTO "exercises" ("user_id", "name", "unit", "group", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", nil], ["name", nil], ["unit", nil], ["group", nil], ["created_at", "2023-05-15 11:50:36.016242"], ["updated_at", "2023-05-15 11:50:36.016242"]]
---
  def create
    @exercise = Exercise.new(exercise_params)

    if @exercise.save

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 7]]
---
  def destroy
    @exercise = Exercise.find(params[:id])
    if current_user.id == @exercise.user_id
      @exercise.destroy