app/controllers/exercise_controller.rb

INSERT INTO "exercises" ("user_id", "name", "unit", "group", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Incline Dumbbell Bench Press"], ["unit", "kg/db"], ["group", "Chest"], ["created_at", "2023-05-15 11:52:40.665900"], ["updated_at", "2023-05-15 11:52:40.665900"]]
---
  def set_date_range
    if @exercise.sets.exists?
      @from = @exercise.sets.order(:created_at).first.created_at.to_date