app/controllers/users_controller.rb

    def view
        @user = User.find(params[:id])
        @exercises = Exercise.where(user_id: params[:id])
        @workouts = Workout.where(user_id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = ?  [["user_id", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 1]]