app/controllers/workout_controller.rb

  def view
    @workout = Workout.find(params[:id])
    @sets = @workout.sets.group_by(&:exercise)
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."exercise_id" = ? ORDER BY "workouts"."created_at" DESC  [["exercise_id", 1]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def finish
    # Get all unassigned sets
    @unassigned_sets = current_user.sets.where(workout_id: nil).group_by(&:exercise)
    @sets = current_user.sets.where(workout_id: nil)

    # Create a new workout
    @workout = Workout.new(
      user: current_user,
      started_at: @sets.first.created_at,
      ended_at: Time.zone.now,
      title: "Workout on #{Time.zone.now.strftime('%A')}",
      exercises_used: @unassigned_sets.length,
      sets_completed: @sets.length
    )
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]