app/controllers/workout_controller.rb

  def destroy
    @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]

  def load_unassigned_sets
    @unassigned_sets = Allset.where(user_id: current_user.id, belongs_to_workout: nil)
                             .where('created_at >= ?', Time.current.beginning_of_day)
                             .group_by(&:exercise)
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]