app/controllers/workout_controller.rb

  def finish
    @unassigned_sets = Allset.where(user_id: current_user.id, belongs_to_workout: nil).group_by(&:exercise)
    @sets = Allset.where(user_id: current_user.id, belongs_to_workout: nil)

    if @unassigned_sets.length > 0
      @workout = Workout.new
      @workout.user_id = current_user.id
      @workout.started_at = @sets.first.created_at
---
INSERT INTO "workouts" ("exercise_id", "repetitions", "weight", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["exercise_id", nil], ["repetitions", 5], ["weight", 5.0], ["created_at", "2023-05-17 23:17:36.164482"], ["updated_at", "2023-05-17 23:17:36.164482"], ["user_id", nil]]